XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>RW612_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for RW612</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="16.3.0" date="2023-12-15">NXP CMSIS Packs based on MCUXpresso SDK 2.13.3</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
  </taxonomy>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="5.8.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="RW612" Dvendor="NXP:11">
      <debugconfig default="swd" clock="5000000" swj="true"/>
      <description>RW61X</description>
      <device Dname="RW612">
        <processor Dcore="Cortex-M33" Dfpu="SP_FPU" Dmpu="MPU" Dtz="TZ" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="260000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/RW612_flash.icf"/>
        </environment>
        <sequences>
          <sequence name="EnableDebugMailbox">
            <block/>
            <control if="!(ReadAP(0x0) &amp; 0x40)">
              <!-- Check AHB-AP CSW DbgStatus to decide if need enable DebugMailbox -->
              <block>
        __var status=0x55aa;
        Message(0, "RW61X connect srcipt start");

        // Read APIDR
        __dp = 0;
        __ap = 3;
        status = ReadAP(0xFC);
        Message(0, "APIDR: 0x%08X", status);

        // Read DPIDR
        __dp = 0;
        __ap = 3;
        status = ReadDP(0x0);
        Message(0, "DPIDR: 0x%08X", status);

        // Active DebugMailbox
        __dp = 0;
        __ap = 3;
        WriteAP(0x0, 0x00000021);
        DAP_Delay(30000);
        ReadAP(0x0);

        // Enter Debug Session
        __dp = 0;
        __ap = 3;
        WriteAP(0x4, 0x00000007);
        DAP_Delay(30000);
        ReadAP(0x0);

        __dp = 0;
        __ap = 0;

        Message(0, "RW61X connect srcipt end");
      </block>
            </control>
          </sequence>
          <sequence name="DebugPortStart">
            <block>
      __var SW_DP_ABORT  = 0x0;
      __var DP_CTRL_STAT = 0x4;
      __var DP_SELECT    = 0x8;
      __var powered_down = 0;
      // Switch to DP Register Bank 0
      WriteDP(DP_SELECT, 0x00000000);

      // Read DP CTRL/STAT Register and check if CSYSPWRUPACK and CDBGPWRUPACK bits are set
      powered_down = ((ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000);
    </block>
            <control if="powered_down">
              <block>
        // Request Debug/System Power-Up
        WriteDP(DP_CTRL_STAT, 0x50000000);
      </block>
              <!-- Wait for Power-Up Request to be acknowledged -->
              <control while="(ReadDP(DP_CTRL_STAT) &amp; 0xA0000000) != 0xA0000000" timeout="1000000"/>
              <!-- SWD Specific Part of sequence -->
              <control if="(__protocol &amp; 0xFFFF) == 2">
                <block>
          // Init AP Transfer Mode, Transaction Counter, and Lane Mask (Normal Transfer Mode, Include all Byte Lanes)
          WriteDP(DP_CTRL_STAT, 0x50000F00);

          // Clear WDATAERR, STICKYORUN, STICKYCMP, and STICKYERR bits of CTRL/STAT Register by write to ABORT register
          WriteDP(SW_DP_ABORT, 0x0000001E);

          Sequence("EnableDebugMailbox");
        </block>
              </control>
            </control>
          </sequence>
          <sequence name="WaitForStopAfterReset">
            <block>
      __var SCS_Addr    = 0xE000E000;
      __var DHCSR_Addr  = SCS_Addr + 0xDF0;
      __var DFSR_Addr  = SCS_Addr + 0xD30;
      DAP_Delay(100000);  // Give bootloader time to do what it needs to do
      Sequence("EnableDebugMailbox");
      Write32(DHCSR_Addr, 0xA05F0003);  // Halt the core in case it didn't stop at a breakpiont.
      // Clear watch point
      Write32(0xE0001020, 0x0);
      Write32(0xE0001028, 0x0);

      // Clear XPSR to avoid undefined instruction fault caused by IT/ICI
      Write32(0xE000EDF8, 0x01000000);
      Write32(0xE000EDF4, 0x00010010);
      // Set MSPLIM to 0
      Write32(0xE000EDF8, 0x00000000);
      Write32(0xE000EDF4, 0x0001001C);
    </block>
          </sequence>
          <sequence name="ResetHardware">
            <block>
      __var nReset      = 0x80;
      __var canReadPins = 0;
      __var SCS_Addr    = 0xE000E000;
      __var DHCSR_Addr  = SCS_Addr + 0xDF0;

      // De-assert nRESET line
      canReadPins = (DAP_SWJ_Pins(0x00, nReset, 0) != 0xFFFFFFFF);
    </block>
            <!-- Keep reset active for 50 ms -->
            <control while="1" timeout="50000"/>
            <control if="canReadPins">
              <!-- Assert nRESET line and wait max. 1s for recovery -->
              <control while="(DAP_SWJ_Pins(nReset, nReset, 0) &amp; nReset) == 0" timeout="1000000"/>
            </control>
            <control if="!canReadPins">
              <block>
        // Assert nRESET line
        DAP_SWJ_Pins(nReset, nReset, 0);
      </block>
              <!-- Wait 100ms for recovery if nRESET not readable -->
              <control while="1" timeout="100000"/>
            </control>
            <control if="(__connection &amp; (1 &lt;&lt; 17)) == 0">
              <block>
        Sequence("WaitForStopAfterReset");
      </block>
            </control>
          </sequence>
          <sequence name="ResetSystem">
            <block>
      __dp = 0;
      __ap = 0;
       // System Control Space (SCS) offset as defined in Armv6-M/Armv7-M.
       __var SCS_Addr   = 0xE000E000;
       __var AIRCR_Addr = SCS_Addr + 0xD0C;
       __var DHCSR_Addr = SCS_Addr + 0xDF0;
       __var DEMCR_Addr = SCS_Addr + 0xDFC;
       __var tmp;
       //Halt the core
       Write32(DHCSR_Addr, 0xA05F0003);
       //clear VECTOR CATCH and set TRCENA
       tmp = Read32(DEMCR_Addr);
       Write32(DEMCR_Addr, tmp | 0x1000000);
       // Set watch point at SYSTEM_STICK_CALIB access
       Write32(0xE0001020, 0x50002034);
       Write32(0xE0001028, 0x00000814);
       //PMU-&gt;SYS_RST_EN, enable system reset
       Write32(0x40031008, 0x1);
       __errorcontrol = 1;
       // Execute SYSRESETREQ via AIRCR
       Write32(AIRCR_Addr, 0x05FA0004);
      Sequence("WaitForStopAfterReset");
       __errorcontrol = 0;
    </block>
          </sequence>
        </sequences>
        <memory name="BootROM" start="0x03000000" size="0x040000" access="rx"/>
        <memory name="BootROM_alias" start="0x13000000" size="0x040000" access="rx" alias="BootROM"/>
        <memory name="SRAM" start="0x00000000" size="0x130000" access="rw" default="1"/>
        <memory name="SRAM_alias1" start="0x10000000" size="0x130000" access="rw" alias="SRAM"/>
        <memory name="SRAM_alias2" start="0x20000000" size="0x130000" access="rw" alias="SRAM"/>
        <memory name="SRAM_alias3" start="0x30000000" size="0x130000" access="rw" alias="SRAM"/>
        <algorithm name="arm/RW61X_FlexSPI_A_QSPI.FLM" start="0x08000000" size="0x04000000" RAMstart="0x00000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/RW61X_FlexSPI_A_QSPI_S.FLM" start="0x18000000" size="0x04000000" RAMstart="0x00000000" RAMsize="0x00001000" default="1"/>
        <debug svd="RW612.xml" __dp="0" __ap="0"/>
        <variant Dvariant="RW612HNA1I">
          <compile header="fsl_device_registers.h" define="CPU_RW612HNA1I"/>
        </variant>
        <variant Dvariant="RW612ETA1I">
          <compile header="fsl_device_registers.h" define="CPU_RW612ETA1I"/>
        </variant>
        <variant Dvariant="RW612UKA1I">
          <compile header="fsl_device_registers.h" define="CPU_RW612UKA1I"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.RW612">
      <accept Dname="RW612" Dvariant="RW612HNA1I" Dvendor="NXP:11"/>
      <accept Dname="RW612HNA1I" Dvendor="NXP:11"/>
      <accept Dname="RW612" Dvariant="RW612ETA1I" Dvendor="NXP:11"/>
      <accept Dname="RW612ETA1I" Dvendor="NXP:11"/>
      <accept Dname="RW612" Dvariant="RW612UKA1I" Dvendor="NXP:11"/>
      <accept Dname="RW612UKA1I" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.serial_manager_AND_utility.assert_AND_utility.debug_console">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="utility.assert_lite_AND_utility.debug_console_lite">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
