XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <condition id="device.RW612_AND_component.els_pkc.ecc_AND_component.els_pkc.els_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.session">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_els"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_session"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_ecc"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.key_AND_component.els_pkc.padding_AND_component.els_pkc.toolchain">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_key"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_toolchain"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_padding"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.mac">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_mac"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.pkc_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_pkc"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.data_integrity_AND_component.els_pkc.flow_protection_AND_component.els_pkc.param_integrity_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.toolchain">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_param_integrity"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_data_integrity"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_toolchain"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_common"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.ecc_AND_component.els_pkc.math_AND_component.els_pkc.rsa">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_ecc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_math"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_rsa"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc_AND_component.els_pkc.platform.rw61x_interface_files_AND_component.els_pkc.trng.type_rng4">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_rw61x_interface_files"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng_type_rng4"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.els_common_AND_component.els_pkc.els_header_only_AND_component.els_pkc.platform.rw61x_interface_files_AND_component.els_pkc.standalone_gdet_AND_component.els_pkc.standalone_keyManagement">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_els_header_only"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_els_common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_standalone_keyMgmt"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_standalone_gdet"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_rw61x_interface_files"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.platform.rw61x">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_platform_rw61x"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.psa_driver_AND_component.els_pkc.session">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_session"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_psa_driver"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.prng_AND_component.els_pkc.random_modes_AND_component.els_pkc.secure_counter">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_random_modes"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_prng"/>
    </condition>
