XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <condition id="device.RW612_AND_component.els_pkc.aes_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.trng">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_aes"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pkc_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.toolchain">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_pkc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_toolchain"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.random_AND_component.els_pkc.secure_counter_AND_component.els_pkc.toolchain">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_toolchain"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_random"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.els_header_only_AND_component.els_pkc.flow_protection_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_els_header_only"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.memory">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
    </condition>
    <condition id="armclang">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_els"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.trng">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_els"/>
    </condition>
    <condition id="device.RW612_AND_component.els_pkc.trng">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.flexcomm_i2c">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.flexcomm_spi">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.flexspi">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.imu">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="imu"/>
    </condition>
    <condition id="device.RW612_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_utility.str">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
    </condition>
    <condition id="device.RW612_AND_component.log_AND_driver.common_AND_utility.debug_console">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
