XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <condition id="device.RW612_AND_component.log_AND_driver.common_AND_utility.debug_console_lite">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.RW612_AND_component.log_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.lpc_crc">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc"/>
    </condition>
    <condition id="device.RW612_AND_driver.inputmux_AND_driver.lpc_gpio_AND_driver.pint">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pint"/>
    </condition>
    <condition id="device.RW612_AND_component.lists_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
    </condition>
    <condition id="device.RW612_AND_component.lists_AND_component.mem_manager_light_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
    </condition>
    <condition id="device.RW612_AND_component.mflash.common_AND_driver.cache_cache64_AND_driver.flexspi">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="cache"/>
    </condition>
    <condition id="device.RW612_AND_component.mflash_file">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_file"/>
    </condition>
    <condition id="device.RW612_AND_component.mflash.rdrw610">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rdrw610"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.mrt">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="device.RW612_AND_component.lists_AND_component.osa_interface_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="osa_interface"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.ostimer">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
    </condition>
    <condition id="device.RW612_AND_component.power_manager_core">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power_manager_core"/>
    </condition>
    <condition id="component.serial_manager_spi_OR_component.serial_manager_swo_OR_component.serial_manager_uart_OR_component.serial_manager_virtual">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="device.RW612_AND__component.serial_manager_spi_OR_component.serial_manager_swo_OR_component.serial_manager_uart_OR_component.serial_manager_virtual__AND_component.lists_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="component.serial_manager_spi_OR_component.serial_manager_swo_OR_component.serial_manager_uart_OR_component.serial_manager_virtual"/>
    </condition>
    <condition id="device.RW612_AND_component.flexcomm_spi_adapter_AND_component.serial_manager_AND_driver.flexcomm_spi">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_spi_adapter"/>
    </condition>
    <condition id="device.RW612_AND_component.serial_manager_AND_core_type.cm33_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Dcore="Cortex-M33" Dfpu="SP_FPU"/>
    </condition>
    <condition id="device.RW612_AND_component.serial_manager_AND_component.usart_adapter_AND_driver.flexcomm_usart">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.RW612_AND_component.serial_manager_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.RW612_AND_component.silicon_id_rw610_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_rw610"/>
    </condition>
    <condition id="device.RW612_AND_component.silicon_id_AND_driver.ocotp">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp"/>
    </condition>
