XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <condition id="device.RW612_AND_driver.flexcomm_AND_driver.flexcomm_usart_AND_driver.lpc_dma">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="device.RW612_AND_driver.flexspi_AND_driver.lpc_dma">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
    </condition>
    <condition id="device.RW612_AND_CMSIS_Driver_Include.I2C">
      <require condition="device.RW612"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Csub="Custom" Capiversion="2.4.0"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.inputmux_connections">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
    </condition>
    <condition id="device.RW612_AND_driver.lcdic_AND_driver.lpc_dma">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lcdic"/>
    </condition>
    <condition id="device.RW612_AND_driver.flexspi_AND_driver.nor_flash-common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
    </condition>
    <condition id="device.RW612_AND_driver.phy-common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
    </condition>
    <condition id="device.RW612_AND_driver.rtt.template">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="template"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.smartcard_usim">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_usim"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.RW612_AND_driver.common_AND_driver.power">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.RW612_AND_component.codec_i2c_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="codec_i2c"/>
    </condition>
    <condition id="device.RW612_AND_utility.debug_console">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="device.RW612_AND_utility.debug_console_lite">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.RW612_AND_component.usart_adapter_AND_driver.common">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.RW612_AND_component.lists_AND_driver.common_AND_utility.str">
      <require condition="device.RW612"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="RW612" Cversion="1.0.0" condition="device.RW612_AND___component.serial_manager_AND_utility.assert_AND_utility.debug_console__OR__utility.assert_lite_AND_utility.debug_console_lite___AND_component.els_pkc.platform.rw61x_AND_component.usart_adapter_AND_device.RW612_startup_AND_driver.cache_cache64_AND_driver.clock_AND_driver.cns_io_mux_AND_driver.common_AND_driver.flexcomm_usart_AND_driver.flexspi_AND_driver.lpc_gpio_AND_driver.ocotp_AND_driver.power_AND_driver.reset" isDefaultVariant="1">
      <description>Devices_project_template RW612</description>
      <files>
        <file category="header" attr="config" name="project_template/board.h" version="1.0.0"/>
        <file category="sourceC" attr="config" name="project_template/board.c" version="1.0.0"/>
        <file category="header" attr="config" name="project_template/clock_config.h" version="1.0.0"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c" version="1.0.0"/>
        <file category="header" attr="config" name="project_template/pin_mux.h" version="1.0.0"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c" version="1.0.0"/>
        <file category="header" attr="config" name="project_template/peripherals.h" version="1.0.0"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RW612">
      <description>Rte_device</description>
      <files>
        <file category="header" attr="config" name="template/RTE_Device.h" version="1.0.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="audio_flexcomm_i2s_dma_adapter" Cversion="1.0.0" condition="device.RW612_AND_driver.common_AND_driver.flexcomm_i2s_dma">
      <description>Component flexcomm_i2s_dma_adapter</description>
      <files>
        <file category="header" name="components/audio/fsl_adapter_audio.h"/>
        <file category="sourceC" name="components/audio/fsl_adapter_flexcomm_i2s.c"/>
      </files>
    </component>
