XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_aes" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.key">
      <description>Component aes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClAes/src/mcuxClAes_KeyTypes.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/mcuxClAes_KeyTypes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Ctx.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Internal_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Internal_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClAes/inc/internal/mcuxClAes_Wa.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_cipher" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.session">
      <description>Component els_pkc.cipher</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipher/src/mcuxClCipher.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/mcuxClCipher_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipher/inc/internal/mcuxClCipher_Internal_Types.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_cipher_modes" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.cipher">
      <description>Component els_pkc.cipher</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Els_Aes.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Els_EngineAes.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Helper.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClCipherModes/src/mcuxClCipherModes_Modes.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/mcuxClCipherModes_Modes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Algorithms_Els.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Helper.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Internal_Functions_Els.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Internal_Types_Els.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Internal_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCipherModes/inc/internal/mcuxClCipherModes_Wa.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_common" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory">
      <description>Component els pkc common</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/common/src/mcuxClOscca_CommonOperations.c"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_FunctionIdentifiers.h"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_Memory.h"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_PlatformTypes.h"/>
        <file category="header" name="components/els_pkc/src/comps/common/inc/mcuxClOscca_Types.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_core" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc.core</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Buffer.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Examples.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_FunctionIdentifiers.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Platform.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClCore/inc/mcuxClCore_Toolchain.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
