XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00704.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00779.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00005.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00134.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/functions_vars_a.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00572.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00962.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00855.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00506.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00759.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00551_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00290_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00990.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01210.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00071.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00775.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00665_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00958.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00587.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/functions_vars_s.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00790.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/folderclosed.svg"/>
        <file category="image" name="components/els_pkc/doc/rw61x/html/nav_g.png"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00979.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00792.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a01198.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01022.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00920.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00882.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00005.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00948.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/annotated_dup.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01378.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00831.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/docd.svg"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00371_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00808.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00509.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00935.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/navtreeindex37.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/globals_a.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00164.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00752.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00467.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00777.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00803.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00407_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00917.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00449_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00254.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/functions_vars_k.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00834.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00871.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01381.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00783.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00778.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00485.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00536.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00554.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00392.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00485.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00860.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00686.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00850.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00668_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00713_source.html"/>
        <file category="image" name="components/els_pkc/doc/rw61x/html/doc.png"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00998.html"/>
        <file category="image" name="components/els_pkc/doc/rw61x/html/sync_on.png"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00791.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00515_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00785.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00374_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/navtree.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/doc.svg"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00116.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01011.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00758.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00596.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00954.js"/>
        <file category="image" name="components/els_pkc/doc/rw61x/html/nav_f.png"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00845.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/navtreeindex11.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00850.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00428.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00500.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01349.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00629_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00806.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00787.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00818.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00870.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00895.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00980.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00771.js"/>
        <file category="image" name="components/els_pkc/doc/rw61x/html/doxygen.png"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00419_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00788.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00686_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01078.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00710_source.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00011.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00620.js"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00768.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00497_source.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/modules.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00719.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01007.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01379.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00446.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00659.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00377.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00771.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00659.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00890.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00938.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00797.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/jquery.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00825.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/functions_a.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00014.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00746.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00545.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01017.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00736.html"/>
        <file category="image" name="components/els_pkc/doc/rw61x/html/folderopen.png"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/functions.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00269.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00449.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a01004.html"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00780.html"/>
        <file category="other" name="components/els_pkc/doc/rw61x/html/a00947.js"/>
        <file category="doc" name="components/els_pkc/doc/rw61x/html/a00458.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00404.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00707.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00907.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00299_source.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00595.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00820.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00824.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00697.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00209_source.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00880.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00203.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a01047.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00701.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00119.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00697.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00194_source.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00660.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00748.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00437.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00646.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00877.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00632.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00251.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00785.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00620.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00731.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00341_source.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00509_source.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00470.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00840.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00023.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00798.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00566.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00287_source.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/dir_dd8c3bc83d3be585c1ed60df1e2e3674.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00137.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00488.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00837.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/functions_i.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00494.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00676.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/dir_4c1be71eefb80ba56a7aad82f19be412.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00688.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/navtreeindex25.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00794.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00765.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00038.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/navtreeindex9.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00143.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/dir_f2059cb3a3cec76a8054f9a38a3b61dc.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00401_source.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00359.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00545.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00891.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a01205.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00344_source.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00611.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00695.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00374.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00497.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00777.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00014.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/functions_vars_d.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00609.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00853.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/dir_e8545303b4fb78d19ff878b81818ebbd.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00676.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00284.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/functions_v.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/a00551.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00185.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/a00615.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/groups_a.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_0.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_a.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_2.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_d.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_12.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_13.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_e.js"/>
        <file category="image" name="components/els_pkc/doc/lpc/html/search/search_r.png"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_11.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_9.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_14.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_8.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_5.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_9.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_f.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/files_0.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/groups_a.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_4.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_5.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_1.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_0.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_d.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_13.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/pages_1.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_3.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/groups_0.js"/>
        <file category="image" name="components/els_pkc/doc/lpc/html/search/search_l.png"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/groups_3.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_8.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_14.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/defines_1.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_c.html"/>
        <file category="image" name="components/els_pkc/doc/lpc/html/search/mag_sel.png"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/search.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_2.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_1.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_c.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_14.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_11.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_2.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_13.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/pages_0.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/search.css"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/classes_0.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/groups_9.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/functions_0.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_12.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_14.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_10.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_f.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_12.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/functions_0.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/groups_4.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/defines_2.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/groups_9.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_e.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_d.js"/>
        <file category="image" name="components/els_pkc/doc/lpc/html/search/close.png"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/variables_b.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_3.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/groups_0.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_f.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_11.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/searchdata.js"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/all_8.html"/>
        <file category="doc" name="components/els_pkc/doc/lpc/html/search/files_1.html"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_c.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/variables_7.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/pages_0.js"/>
        <file category="other" name="components/els_pkc/doc/lpc/html/search/all_6.js"/>
