XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00251.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00365_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00563_source.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00846.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/pages.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/navtreeindex33.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00317.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00032.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00835.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00455.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00915.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00696.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00638_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00702.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00897.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00826.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00713.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00158.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00560.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00955.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00704.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00779.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00664.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00287.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00005.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00669.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00134.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a01237.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/functions_vars_a.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00572.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00962.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01287.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00855.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00506.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00715.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00759.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00551_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00290_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/globals_k.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00434.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01045.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00775.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00958.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00587.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/functions_vars_s.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00218.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a01269.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00790.js"/>
        <file category="image" name="components/els_pkc/doc/mcxn/html/nav_g.png"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00792.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00993.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00661.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01057.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00920.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00882.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00005.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00948.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/annotated_dup.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00831.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00681.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00371_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00808.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00935.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/navtreeindex37.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/globals_a.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00164.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00752.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00467.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00777.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00803.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00407_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00917.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00747.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00449_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/functions_vars_k.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00783.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00778.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00485.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00224.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01304.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/dir_b19d4aa211bb6dbce6ab36de7af852a2.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00536.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00392.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00734.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00329.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00485.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00860.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00686.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00850.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01265.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01305.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00735.html"/>
        <file category="image" name="components/els_pkc/doc/mcxn/html/doc.png"/>
        <file category="image" name="components/els_pkc/doc/mcxn/html/sync_on.png"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00666.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00791.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00515_source.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00785.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00374_source.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/navtree.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00116.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00758.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00720.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00596.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00206_source.html"/>
        <file category="image" name="components/els_pkc/doc/mcxn/html/nav_f.png"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00845.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/navtreeindex11.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00850.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00428.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00629_source.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00806.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00787.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00818.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00221_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00870.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00895.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00176.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00663.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00771.js"/>
        <file category="image" name="components/els_pkc/doc/mcxn/html/doxygen.png"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00419_source.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00788.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a01285.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00011.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00620.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00768.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00497_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/modules.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00719.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00446.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00224_source.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00771.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00890.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00938.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00797.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/jquery.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00825.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a01269.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/functions_a.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00014.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00746.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00729.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00736.html"/>
        <file category="image" name="components/els_pkc/doc/mcxn/html/folderopen.png"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/functions.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00449.html"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00711.js"/>
        <file category="other" name="components/els_pkc/doc/mcxn/html/a00440.js"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00780.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00714.html"/>
        <file category="doc" name="components/els_pkc/doc/mcxn/html/a00458.html"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
