XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_flow_protection" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.core">
      <description>Component els_pkc.flow_protection</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Cfg.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_FunctionIdentifiers.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_Impl.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Common.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslFlowProtection/inc/mcuxCsslFlowProtection_SecureCounter_Local.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_hash" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.hashmodes_AND_component.els_pkc.session">
      <description>Component els_pkc.hash</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_common.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_multipart_compute.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHash/src/mcuxClHash_api_oneshot_compute.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/mcuxClHash_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHash/inc/internal/mcuxClHash_Internal_Memory.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_hashmodes" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.session">
      <description>Component els_pkc.hashmodes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Core_els_sha2.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHashModes/src/mcuxClHashModes_Internal_els_sha2.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Algorithms.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/mcuxClHashModes_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Core_els_sha2.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_els_sha2.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHashModes/inc/internal/mcuxClHashModes_Internal_Memory.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_hmac" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.session">
      <description>Component els_pkc.hmac</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Els.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Functions.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Helper.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Modes.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_KeyTypes.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClHmac/src/mcuxClHmac_Sw.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Modes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_KeyTypes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/mcuxClHmac_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Core_Functions_Els.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Core_Functions_Sw.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Macros.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClHmac/inc/internal/mcuxClHmac_Internal_Memory.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_key" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.ecc_AND_component.els_pkc.els_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.session">
      <description>Component els_pkc.key</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClKey/src/mcuxClKey_Protection.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/mcuxClKey_ProtectionMechanisms.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Functions_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Protection_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClKey/inc/internal/mcuxClKey_Types_Internal.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_mac" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.key_AND_component.els_pkc.padding_AND_component.els_pkc.toolchain">
      <description>Component els_pkc.mac</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClMac/src/mcuxClMac.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/mcuxClMac_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Ctx.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClMac/inc/internal/mcuxClMac_Internal_Types.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
