XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_padding" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc.padding</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPadding/src/mcuxClPadding.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/mcuxClPadding_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Functions_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPadding/inc/internal/mcuxClPadding_Types_Internal.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_param_integrity" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <description>Component els_pkc.param_integrity</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/src/mcuxCsslParamIntegrity.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslParamIntegrity/inc/mcuxCsslParamIntegrity.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_comp_pkc" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.ecc_AND_component.els_pkc.math_AND_component.els_pkc.rsa">
      <description>Component pkc</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Calculate.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_ImportExport.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_Initialize.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPkc/src/mcuxClPkc_UPTRT.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/mcuxClPkc_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_FupMacros.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_ImportExport.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Inline_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Macros.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Operations.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_SfrAccess.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPkc/inc/internal/mcuxClPkc_Resource.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_platform_rw61x" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc_AND_component.els_pkc.platform.rw61x_interface_files_AND_component.els_pkc.trng.type_rng4">
      <description>Component els_pkc for RW61x platform</description>
      <files>
        <file category="doc" name="components/els_pkc/src/platforms/rw61x/readme.txt"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/platforms/rw61x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_rw61x_interface_files" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc for RW61x interface files</description>
      <files>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/platform_specific_headers.h"/>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/mcuxClConfig.h"/>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/inc/ip_css_constants.h"/>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/inc/ip_css_design_configuration.h"/>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/inc/ip_platform.h"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/rw61x/mcux_els.c"/>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/mcux_els.h"/>
        <file category="sourceC" name="components/els_pkc/src/platforms/rw61x/mcux_pkc.c"/>
        <file category="header" name="components/els_pkc/src/platforms/rw61x/mcux_pkc.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_rw61x_minimal_interface" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_common_AND_component.els_pkc.els_header_only_AND_component.els_pkc.platform.rw61x_interface_files_AND_component.els_pkc.standalone_gdet_AND_component.els_pkc.standalone_keyManagement">
      <description>Component els_pkc for standalone clib-interface of Gdet sensor</description>
      <files>
        <file category="doc" name="components/els_pkc/src/platforms/rw61x/readme.txt"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/platforms/rw61x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_pre_processor" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc.pre_processor</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslAnalysis.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslCPreProcessor/inc/mcuxCsslCPreProcessor.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_prng" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.ecc_AND_component.els_pkc.math_AND_component.els_pkc.rsa">
      <description>Component prng</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPrng/src/mcuxClPrng_ELS.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPrng/inc/internal/mcuxClPrng_Internal_ELS.h"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClPrng/inc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_psa_driver" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.platform.rw61x">
      <description>Component els_pkc_psa_driver</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Aead.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Cipher.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_DER_functions.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_export_public_key.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_generate_ecp_key.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Hash.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Key.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Mac.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Rsa.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Sign.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_UpdateKeyStatus.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClPsaDriver/src/mcuxClPsaDriver_Verify.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/mcuxClPsaDriver_Oracle.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Macros.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClPsaDriver/inc/internal/mcuxClPsaDriver_Types.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_psa_driver_examples" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.psa_driver_AND_component.els_pkc.session">
      <description>Component els_pkc psa_driver examples</description>
      <files>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_aead_ccm_multipart_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_aead_ccm_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_aead_gcm_multipart_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_aead_gcm_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_aes_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_cipher_decrypt.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_cipher_multipart_CBC.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_cipher_multipart_CTR.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_cipher_multipart_ECB.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_eccsecp224k1_sign_verify_hash_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_ecdsa_sign_verify_hash_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_ecdsa_sign_verify_message_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_keygen_export_public_key_brainpoolpr1_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_keygen_export_public_key_mont_curve25519_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_keygen_export_public_key_oracle_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_keygen_export_public_key_rsa_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_keygen_export_public_key_secpk1_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_keygen_export_public_key_secpr1_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_mac_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_mac_sign_multipart_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_mac_verify_multipart_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_rsa_PKCS1V15_sign_verify_message_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_rsa_PSS_sign_verify_hash_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha224_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha256_abort_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha256_clone_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha256_multipart_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha256_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha384_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_sha512_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_truncated_mac_oneshot_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_ecdsa_keygen_oracleMemory_sign_verify_hash_example.c"/>
        <file category="sourceC" name="components/els_pkc/examples/mcuxClPsaDriver/mcuxClPsaDriver_ecdsa_keygen_oracleS50_sign_verify_hash_example.c"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_random" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.prng_AND_component.els_pkc.random_modes_AND_component.els_pkc.secure_counter">
      <description>Component els_pkc.random</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_DRBG.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandom/src/mcuxClRandom_PRNG.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/mcuxClRandom_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandom/inc/internal/mcuxClRandom_Internal_Memory.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_random_modes" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.aes_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.trng">
      <description>Component els_pkc.random_modes</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_Els.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_CtrDrbg_PrDisabled.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_ElsMode.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_NormalMode.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PrDisabled.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_PatchMode.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRandomModes/src/mcuxClRandomModes_TestMode.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_PatchMode.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_Functions_TestMode.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/mcuxClRandomModes_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Internal_SizeDefinitions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_CtrDrbg_BlockCipher.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_Drbg.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_NormalMode.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PrDisabled.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_PatchMode.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRandomModes/inc/internal/mcuxClRandomModes_Private_TestMode.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
