XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_rsa" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pkc_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter_AND_component.els_pkc.toolchain">
      <description>Component els_pkc.rsa</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ComputeD.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ComputeD_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_GenerateProbablePrime.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Crt.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Crt_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_KeyGeneration_Plain.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Mgf1.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_MillerRabinTest.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_MillerRabinTest_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_ModInv.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_NoEncode.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_NoVerify.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Encode_sign.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Pkcs1v15Verify.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivateCrt.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivateCrt_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PrivatePlain.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PssEncode.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_PssVerify.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Public.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Public_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Sign.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPQDistance.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPQDistance_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPrimeCandidate.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_TestPrimeCandidate_FUP.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_Verify.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_VerifyE.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_RemoveBlinding.c"/>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClRsa/src/mcuxClRsa_RemoveBlinding_FUP.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_ComputeD_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_KeyGeneration_Crt_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_MillerRabinTest_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_PrivateCrt_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Public_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_TestPQDistance_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_TestPrimeCandidate_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_RemoveBlinding_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/mcuxClRsa_RemoveBlinding_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_ComputeD_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Macros.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_MemoryConsumption.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_PkcDefs.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_KeyGeneration_Crt_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_MillerRabinTest_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_PrivateCrt_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Public_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_TestPQDistance_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_TestPrimeCandidate_FUP.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClRsa/inc/internal/mcuxClRsa_Internal_PkcTypes.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_secure_counter" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc.secure_counter</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Cfg.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_Impl.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_None.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxCsslSecureCounter/inc/mcuxCsslSecureCounter_SW_Local.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_session" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.random_AND_component.els_pkc.secure_counter_AND_component.els_pkc.toolchain">
      <description>Component els_pkc.session</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClSession/src/mcuxClSession.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/mcuxClSession_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClSession/inc/internal/mcuxClSession_Internal_Functions.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
