XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_standalone_gdet" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_header_only_AND_component.els_pkc.flow_protection_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <description>Component els_pkc standalone_gdet</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEls/src/mcuxClEls_GlitchDetector.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEls/inc/mcuxClEls_GlitchDetector.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_standalone_keyMgmt" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.memory">
      <description>Component els_pkc standalone_keyManagement</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClEls/src/mcuxClEls_KeyManagement.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClEls/inc/mcuxClEls_KeyManagement.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rw61x" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc static_lib rw61x</description>
      <files>
        <file condition="armclang" category="library" name="components/els_pkc/static_library/rw61x/libclns.a"/>
        <file condition="armclang" category="other" name="components/els_pkc/static_library/rw61x/libclns.a.libsize"/>
        <file condition="armclang" category="other" name="components/els_pkc/static_library/rw61x/libclns.a.objsize"/>
        <file condition="armclang" category="library" name="components/els_pkc/static_library/rw61x/libclns.stripped.a"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_toolchain" Cversion="1.7.0" condition="device.RW612">
      <description>Component els_pkc toolchain</description>
      <files>
        <file category="header" name="components/els_pkc/src/compiler/mcuxClToolchain.h"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.flow_protection_AND_component.els_pkc.memory_AND_component.els_pkc.pre_processor_AND_component.els_pkc.secure_counter">
      <description>Component els_pkc.trng</description>
      <files>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Types.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Constants.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_Functions.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_SA_TRNG.h"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClTrng/inc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng_type_els" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.els_AND_component.els_pkc.trng">
      <description>Component els_pkc.trng.type_els</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClTrng/src/mcuxClTrng_ELS.c"/>
        <file category="include" name="components/els_pkc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="els_pkc_trng_type_rng4" Cversion="1.7.0" condition="device.RW612_AND_component.els_pkc.trng">
      <description>Component els_pkc.trng.type_rng4</description>
      <files>
        <file category="sourceC" name="components/els_pkc/src/comps/mcuxClTrng/src/mcuxClTrng_SA_TRNG.c"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_SfrAccess.h"/>
        <file category="header" name="components/els_pkc/src/comps/mcuxClTrng/inc/internal/mcuxClTrng_Internal_SA_TRNG.h"/>
        <file category="include" name="components/els_pkc/"/>
        <file category="include" name="components/els_pkc/src/comps/mcuxClTrng/inc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_i2c_adapter" Cversion="1.0.0" condition="device.RW612_AND_driver.common_AND_driver.flexcomm_i2c">
      <description>Component flexcomm_i2c_adapter</description>
      <files>
        <file category="header" name="components/i2c/fsl_adapter_i2c.h"/>
        <file category="sourceC" name="components/i2c/fsl_adapter_flexcomm_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm_spi_adapter" Cversion="1.0.0" condition="device.RW612_AND_driver.common_AND_driver.flexcomm_spi">
      <description>Component flexcomm_spi_adapter</description>
      <files>
        <file category="header" name="components/spi/fsl_adapter_spi.h"/>
        <file category="sourceC" name="components/spi/fsl_adapter_flexcomm_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adapter_rw61x" Cversion="1.0.0" condition="device.RW612_AND_driver.common_AND_driver.flexspi">
      <description>Component flexspi_nor_flash_adapter_rw61x</description>
      <files>
        <file category="sourceC" name="components/internal_flash/rdrw612bga/fsl_adapter_flexspi_nor_flash.c"/>
        <file category="header" name="components/internal_flash/fsl_adapter_flash.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="imu_adapter" Cversion="1.0.0" condition="device.RW612_AND_driver.common_AND_driver.imu">
      <description>Component imu_adapter</description>
      <files>
        <file category="header" name="components/rpmsg/fsl_adapter_rpmsg.h"/>
      </files>
    </component>
