XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wm8904_adapter" Cversion="2.2.0" condition="device.RW612_AND_driver.codec_AND_driver.wm8904">
      <description>Component wm8904 adapter for single codec</description>
      <files>
        <file category="sourceC" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.c"/>
        <file category="header" name="components/codec/port/wm8904/fsl_codec_wm8904_adapter.h"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="RW612_startup" Cversion="1.0.0" condition="device.RW612_AND_CMSIS_Include_core_cm_AND__armclang_OR_iar_">
      <description>Device RW612_startup</description>
      <files>
        <file category="sourceC" name="system_RW612.c"/>
        <file category="header" name="system_RW612.h"/>
        <file condition="iar" category="sourceAsm" name="iar/startup_RW612.s"/>
        <file condition="mdk" category="sourceAsm" name="arm/startup_RW612.S"/>
        <file condition="core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/RW612_ram.scf" version="1.0.0"/>
        <file condition="core_type.cm33_AND_mdk" category="linkerScript" attr="config" name="arm/RW612_flash.scf" version="1.0.0"/>
        <file condition="core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/RW612_ram.icf" version="1.0.0"/>
        <file condition="core_type.cm33_AND_iar" category="linkerScript" attr="config" name="iar/RW612_flash.icf" version="1.0.0"/>
        <file category="header" name="fsl_device_registers.h"/>
        <file category="header" name="RW612.h"/>
        <file category="header" name="RW612_features.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache" Cversion="2.0.6" condition="device.RW612_AND_driver.common">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_cache.c"/>
        <file category="header" name="drivers/fsl_cache.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cdog" Cversion="2.1.2" condition="device.RW612_AND_driver.common">
      <description>cdog Driver</description>
      <files>
        <file category="header" name="drivers/fsl_cdog.h"/>
        <file category="sourceC" name="drivers/fsl_cdog.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.0.0" condition="device.RW612_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="flexcomm_i2c_cmsis" Cversion="2.3.0" Capiversion="2.3.0" condition="device.RW612_AND_CMSIS_Driver_Include.I2C_AND_RTE_Device_AND_driver.flexcomm_i2c_dma">
      <description>I2C CMSIS Driver</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_i2c_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_i2c_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="flexcomm_spi_cmsis" Cversion="2.5.0" Capiversion="2.2.0" condition="device.RW612_AND_CMSIS_Driver_Include.SPI_AND_RTE_Device_AND_driver.flexcomm_spi_dma">
      <description>SPI CMSIS Driver</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_spi_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_spi_cmsis.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="flexcomm_usart_cmsis" Cversion="2.3.0" Capiversion="2.3.0" condition="device.RW612_AND_CMSIS_Driver_Include.USART_AND_RTE_Device_AND_driver.flexcomm_usart_dma">
      <description>USART CMSIS Driver</description>
      <files>
        <file category="header" name="cmsis_drivers/fsl_usart_cmsis.h"/>
        <file category="sourceC" name="cmsis_drivers/fsl_usart_cmsis.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acomp" Cversion="2.0.1" condition="device.RW612_AND_driver.common">
      <description>ACOMP Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_acomp.c"/>
        <file category="header" name="drivers/fsl_acomp.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.1.0" condition="device.RW612_AND_driver.common">
      <description>ADC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dac" Cversion="2.0.1" condition="device.RW612_AND_driver.common">
      <description>DAC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dac.c"/>
        <file category="header" name="drivers/fsl_dac.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="io_mux" Cversion="2.0.0" condition="device.RW612_AND_driver.common">
      <description>IO_MUX Driver</description>
      <files>
        <file category="header" name="drivers/fsl_io_mux.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="codec" Cversion="2.3.1" condition="device.RW612_AND__component.codec_adapters_OR_component.wm8904_adapter__AND_driver.common">
      <description>Driver codec</description>
      <files>
        <file category="header" name="components/codec/fsl_codec_common.h"/>
        <file category="sourceC" name="components/codec/fsl_codec_common.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.4.0" condition="device.RW612_AND_device.RW612_CMSIS_AND_driver.clock_AND_driver.reset">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
        <file condition="core_type.cm33" category="sourceC" name="drivers/fsl_common_arm.c"/>
        <file condition="core_type.cm33" category="header" name="drivers/fsl_common_arm.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="conn_fwloader" Cversion="1.0.0" condition="device.RW612_AND_component.osa_bm_AND_driver.ocotp">
      <description>Driver conn_fwloader</description>
      <files>
        <file category="header" name="components/conn_fwloader/include/api_tree_root.h"/>
        <file category="header" name="components/conn_fwloader/include/fsl_loader.h"/>
        <file category="header" name="components/conn_fwloader/include/fusemap.h"/>
        <file category="header" name="components/conn_fwloader/include/life_cycle.h"/>
        <file category="header" name="components/conn_fwloader/include/nboot_rom_api_table.h"/>
        <file category="sourceC" name="components/conn_fwloader/fsl_loader.c"/>
        <file category="sourceC" name="components/conn_fwloader/nboot_hal.c"/>
        <file category="sourceC" name="components/conn_fwloader/life_cycle.c"/>
        <file category="doc" name="components/conn_fwloader/readme.txt"/>
        <file category="other" name="components/conn_fwloader/script/fw_bin2c_conv.py"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61x_sb_wifi_a1.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61x_sb_ble_a1.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61x_sb_ble_15d4_combo_a1.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61x_sb_wifi_a2.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61x_sb_ble_a2.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61x_sb_ble_15d4_combo_a2.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61xw_sb_mfg_fw_cpu1_a1.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61xn_sb_mfg_fw_cpu2_ble_a1.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61xn_sb_mfg_fw_cpu2_combo_a1.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61xw_sb_mfg_fw_cpu1_a2.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61xn_sb_mfg_fw_cpu2_ble_a2.bin"/>
        <file category="other" name="components/conn_fwloader/fw_bin/rw61xn_sb_mfg_fw_cpu2_combo_a2.bin"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ctimer" Cversion="2.3.1" condition="device.RW612_AND_driver.common">
      <description>CTimer Driver</description>
      <files>
        <file category="header" name="drivers/fsl_ctimer.h"/>
        <file category="sourceC" name="drivers/fsl_ctimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic" Cversion="2.3.2" condition="device.RW612_AND_driver.common">
      <description>DMIC Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic.c"/>
        <file category="header" name="drivers/fsl_dmic.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmic_dma" Cversion="2.4.0" condition="device.RW612_AND_driver.dmic_AND_driver.lpc_dma">
      <description>DMIC DMA Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dmic_dma.c"/>
        <file category="header" name="drivers/fsl_dmic_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enet" Cversion="2.7.0" condition="device.RW612_AND_driver.common_AND_driver.memory">
      <description>ENET Driver</description>
      <files>
        <file category="header" name="drivers/fsl_enet.h"/>
        <file category="sourceC" name="drivers/fsl_enet.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexcomm" Cversion="2.0.2" condition="device.RW612_AND_driver.common">
      <description>FLEXCOMM Driver</description>
      <files>
        <file category="header" name="drivers/fsl_flexcomm.h"/>
        <file category="sourceC" name="drivers/fsl_flexcomm.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c" Cversion="2.3.3" condition="device.RW612_AND_driver.common_AND_driver.flexcomm">
      <description>I2C Driver</description>
      <files>
        <file category="header" name="drivers/fsl_i2c.h"/>
        <file category="sourceC" name="drivers/fsl_i2c.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_dma" Cversion="2.3.1" condition="device.RW612_AND_driver.common_AND_driver.flexcomm_AND_driver.flexcomm_i2c_AND_driver.lpc_dma">
      <description>I2C Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_i2c_dma.c"/>
        <file category="header" name="drivers/fsl_i2c_dma.h"/>
      </files>
    </component>
