XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/NXP.RW612_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lcdic_dma" Cversion="2.0.0" condition="device.RW612_AND_driver.lcdic_AND_driver.lpc_dma">
      <description>LCDIC DMA Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_lcdic_dma.c"/>
        <file category="header" name="drivers/fsl_lcdic_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc" Cversion="2.1.1" condition="device.RW612_AND_driver.common">
      <description>CRC Driver</description>
      <files>
        <file category="header" name="drivers/fsl_crc.h"/>
        <file category="sourceC" name="drivers/fsl_crc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dma" Cversion="2.5.1" condition="device.RW612_AND_driver.common_AND_driver.memory">
      <description>DMA Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_dma.c"/>
        <file category="header" name="drivers/fsl_dma.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gpio" Cversion="2.1.7" condition="device.RW612_AND_driver.common">
      <description>GPIO Driver</description>
      <files>
        <file category="header" name="drivers/fsl_gpio.h"/>
        <file category="sourceC" name="drivers/fsl_gpio.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc" Cversion="2.1.3" condition="device.RW612_AND_driver.common">
      <description>RTC Driver</description>
      <files>
        <file category="header" name="drivers/fsl_rtc.h"/>
        <file category="sourceC" name="drivers/fsl_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="memory" Cversion="2.0.0" condition="device.RW612_AND_driver.common">
      <description>MEMORY Driver</description>
      <files>
        <file category="header" name="drivers/fsl_memory.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mrt" Cversion="2.0.4" condition="device.RW612_AND_driver.common">
      <description>MRT Driver</description>
      <files>
        <file category="header" name="drivers/fsl_mrt.h"/>
        <file category="sourceC" name="drivers/fsl_mrt.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-common" Cversion="1.0.0" condition="device.RW612">
      <description>Driver nor_flash-common</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="nor_flash-controller-flexspi" Cversion="1.0.0" condition="device.RW612_AND_driver.flexspi_AND_driver.nor_flash-common">
      <description>Driver nor_flash-controller-flexspi</description>
      <files>
        <file category="sourceC" name="components/flash/nor/flexspi/fsl_flexspi_nor_flash.c"/>
        <file category="header" name="components/flash/nor/flexspi/fsl_flexspi_nor_flash.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ocotp" Cversion="2.0.0" condition="device.RW612_AND_driver.common">
      <description>OCOTP Driver</description>
      <files>
        <file category="header" name="drivers/fsl_ocotp.h"/>
        <file category="sourceC" name="drivers/fsl_ocotp.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer" Cversion="2.2.0" condition="device.RW612_AND_driver.common">
      <description>OSTimer Driver</description>
      <files>
        <file category="header" name="drivers/fsl_ostimer.h"/>
        <file category="sourceC" name="drivers/fsl_ostimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common" Cversion="2.0.0" condition="device.RW612">
      <description>Driver phy-common</description>
      <files>
        <file category="header" name="components/phy/fsl_phy.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-ksz8081" Cversion="2.0.0" condition="device.RW612_AND_driver.phy-common">
      <description>Driver phy-device-ksz8081</description>
      <files>
        <file category="header" name="components/phy/device/phyksz8081/fsl_phyksz8081.h"/>
        <file category="sourceC" name="components/phy/device/phyksz8081/fsl_phyksz8081.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pint" Cversion="2.1.12" condition="device.RW612_AND_driver.common">
      <description>PINT Driver</description>
      <files>
        <file category="header" name="drivers/fsl_pint.h"/>
        <file category="sourceC" name="drivers/fsl_pint.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="power" Cversion="2.3.0" condition="device.RW612_AND_driver.common">
      <description>Power driver</description>
      <files>
        <file category="header" name="drivers/fsl_power.h"/>
        <file category="sourceC" name="drivers/fsl_power.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="powerquad" Cversion="2.1.0" condition="device.RW612_AND_driver.common">
      <description>POWERQUAD Driver</description>
      <files>
        <file category="header" name="drivers/fsl_powerquad_data.h"/>
        <file category="sourceC" name="drivers/fsl_powerquad_data.c"/>
        <file category="header" name="drivers/fsl_powerquad.h"/>
        <file category="sourceC" name="drivers/fsl_powerquad_basic.c"/>
        <file category="sourceC" name="drivers/fsl_powerquad_math.c"/>
        <file category="sourceC" name="drivers/fsl_powerquad_matrix.c"/>
        <file category="sourceC" name="drivers/fsl_powerquad_filter.c"/>
        <file category="sourceC" name="drivers/fsl_powerquad_transform.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="reset" Cversion="2.1.2" condition="device.RW612_AND_driver.common">
      <description>Reset Driver</description>
      <files>
        <file category="header" name="drivers/fsl_reset.h"/>
        <file category="sourceC" name="drivers/fsl_reset.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="3.0.0" condition="device.RW612_AND_driver.common">
      <description>ROMAPI Driver</description>
      <files>
        <file category="header" name="drivers/romapi/bootloader/fsl_romapi.h"/>
        <file category="sourceC" name="drivers/romapi/bootloader/fsl_romapi.c"/>
        <file category="header" name="drivers/romapi/otp/fsl_romapi_otp.h"/>
        <file category="sourceC" name="drivers/romapi/otp/fsl_romapi_otp.c"/>
        <file category="header" name="drivers/romapi/nboot/fsl_romapi_nboot.h"/>
        <file category="sourceC" name="drivers/romapi/nboot/fsl_romapi_nboot.c"/>
        <file category="header" name="drivers/romapi/flexspi/fsl_romapi_flexspi.h"/>
        <file category="sourceC" name="drivers/romapi/flexspi/fsl_romapi_flexspi.c"/>
        <file category="header" name="drivers/romapi/iap/fsl_romapi_iap.h"/>
        <file category="sourceC" name="drivers/romapi/iap/fsl_romapi_iap.c"/>
        <file category="header" name="drivers/romapi/iap/fsl_sbloader_v3.h"/>
        <file category="header" name="drivers/romapi/iap/fsl_kb_api.h"/>
        <file category="include" name="drivers/romapi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="device.RW612_AND_driver.rtt.template">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c"/>
        <file condition="iar" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c"/>
        <file condition="mdk" category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c"/>
        <file category="doc" name="components/rtt/License.txt"/>
        <file category="doc" name="components/rtt/README.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="template" Cversion="7.22.0" condition="device.RW612">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sctimer" Cversion="2.4.9" condition="device.RW612_AND_driver.common">
      <description>SCT Driver</description>
      <files>
        <file category="header" name="drivers/fsl_sctimer.h"/>
        <file category="sourceC" name="drivers/fsl_sctimer.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_phy_usim" Cversion="2.3.0" condition="device.RW612_AND_driver.common_AND_driver.smartcard_usim">
      <description>SMARTCARD PHY USIM, use only one SMARTCARD PHY in the project</description>
      <files>
        <file category="header" name="drivers/fsl_smartcard_phy.h"/>
        <file category="sourceC" name="drivers/fsl_smartcard_phy_usim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="smartcard_usim" Cversion="2.3.0" condition="device.RW612_AND_driver.common">
      <description>SMARTCARD USIM Driver</description>
      <files>
        <file category="header" name="drivers/fsl_smartcard.h"/>
        <file category="header" name="drivers/fsl_smartcard_usim.h"/>
        <file category="sourceC" name="drivers/fsl_smartcard_usim.c"/>
      </files>
    </component>
